Revit 2023 API
StructuralSettings.BoundaryConditionFamilySymbolFixed Property
 The id of the FamilySymbol to represent a fixed boundary condition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2011
Syntax
C#
public ElementId BoundaryConditionFamilySymbolFixed { get; set; }
Visual Basic
Public Property BoundaryConditionFamilySymbolFixed As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BoundaryConditionFamilySymbolFixed {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace